#a) яка просить користувача ввести ціле число та відобразити, парне чи непарне це числа


#Number = int(input("введіть ціле число: "))
#if Number % 2 == 0:
   # print("Парне число")
#else:
    #print("Не парне число")

   # \\\\\


#b) просить користувача ввести свій вік і відображає повідомлення «Ви повнолітні! »
#якщо введений вік більше або дорівнює 18 і повідомлення «Ви неповнолітній! »
#якщо введений вік менше 18 років!!!
#age = int(input("введіть свій вік: "))
#if age >= 18:
    #print("ви повнолітній!")
#else:
   # print("ви неповнолітній!")
     #\\\\\\\

#c) Напишіть програму, яка просить користувача ввести радіус кола та відобразити його
#площу та довжину.
#radius = float(input("введіть радіус: "))
#area = math.pi * radius ** 2
#dovgina = 2 * math.pi * radius
#print("площа кола :", area)
#print("довжина кола :", dovgina)
#\\\\\\\


#d) Напишіть програму, яка просить користувача ввести два числа a і b і відобразити
#більше з них.

#a = float(input("введіть число: "))
#b = float(input("ввдіть інше число: "))
#if a > b:
  #  print("більше число:", a)
#elif b > a:
   # print("більше число:", b)
#else:
   # print("числа рівні")
   #\\\\\\


   #Завдання №2 (3 бали)

#x , y = map(int, input("Введіть x та y: ").split())


#if x > 0 and y > 0:
   # print("1 чверть")
#elif x < 0 and y > 0:
    #print("2 чверть")
#elif x < 0 and y < 0:
   # print("3 чверть")
#elif x > 0 and y < 0:
    #print("4 чверть")
#else:
   # print("точка лежить на осі координат")
#\\\\\\\


#Завдання No3 (3 бали)

#Напишіть програму, яка отримує вік людини (ціле число, яке не перевищує 120) і виводить
#цей вік зі словом «рік», «роки» або «років». Наприклад, «21 рік», «22 роки», «25 років».


#age = int(input("введіть вік: "))

#if age % 10 == 1 and age != 11:
    #print(age, "рік")
#elif age % 10 in [2, 3, 4] and not 12 <= age <= 14:
   # print(age, "роки")
#else:
   # print(age, "років")

  # \\\\\\\\\\\\\



#Додаткові завдання

#У деякому місті діє наступна система оплати проїзду в громадському транспорті. Для однієї
#поїздки в будь-якому виді транспорту необхідно закомпостувати попередньо куплений квиток.
#Квитки продаються як поодинці (і в цьому випадку вартість одного квитка дорівнює p1 так і
#пачками по k штук (вартість пачки дорівнює p2).
#Пасажиру необхідно виконати N поїздок в транспорті цього міста. Визначте найменшу
#суму, яку повинен витратити пасажир на ці поїздки.
#Формат вхідних даних. Величини; N, k, p1, p2. Всі величини - додатні цілі числа, що не
#перевищують 10000 (якщо k=1, то p1 = p2).
#Формат вихідних даних. Кількість грошей, яку треба витратити на всі поїздки.
#Приклад вхідних і вихідних даних:

#Input Output

#N = 12
#k = 10
#p1 = 17
#p2 = 120

#154

#N = 18
#k = 10
#p1 = 17
#p2 = 120

#240

#Примітка. У першому прикладі пасажиру необхідно купити одну пачку квитків і два
#окремих квитка. У другому прикладі пасажиру необхідно купити дві пачки квитків, а
#невикористані квитки викинути.


#N = int(input("N = "))
#k = int(input("k = "))
#p1 = int(input("p = "))
#p2 = int(input("p = "))

#packs = N // k
#rest = N % k

#price1 = packs * p2 + rest * p1
#price2 = (packs + 1) * p2
#print (min(price1, price2))








